; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_2 ?v1 - type_3 ?v8 - type_1)
 	      (pred_1 ?v3 - object ?v8 - type_1)
	      (pred_3 ?v1 - type_3 ?v5 - type_2)
	      (pred_4 ?v1 - type_3 ?v3 - object ?v5 - type_2))

   (:action op_1
       :parameters  (?v1 - type_3 ?v7 ?v2 - type_1)
       :precondition (and  (pred_2 ?v1 ?v7))
       :effect (and  (pred_2 ?v1 ?v2)
		     (not (pred_2 ?v1 ?v7))))

   (:action op_2
       :parameters (?v1 - type_3 ?v4 - object ?v6 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_1 ?v4 ?v6) (pred_2 ?v1 ?v6) (pred_3 ?v1 ?v5))
       :effect (and (pred_4 ?v1 ?v4 ?v5)
		    (not (pred_1 ?v4 ?v6)) 
		    (not (pred_3 ?v1 ?v5))))

   (:action op_3
       :parameters (?v1 - type_3 ?v4 - object ?v6 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_4 ?v1 ?v4 ?v5) (pred_2 ?v1 ?v6))
       :effect (and (pred_1 ?v4 ?v6)
		    (pred_3 ?v1 ?v5)
		    (not (pred_4 ?v1 ?v4 ?v5)))))

; problem
(define (problem gripper-2-3-2)
(:domain gripper-strips)
(:objects obj_03 obj_11 - type_3
obj_02 obj_07 obj_05 obj_04 - type_2
obj_08 obj_10 obj_09 - type_1
obj_06 obj_01 - object)
(:init
(pred_2 obj_03 obj_10)
(pred_3 obj_03 obj_02)
(pred_3 obj_03 obj_07)
(pred_2 obj_11 obj_10)
(pred_3 obj_11 obj_05)
(pred_3 obj_11 obj_04)
(pred_1 obj_06 obj_10)
(pred_1 obj_01 obj_09)
)
(:goal
(and
(pred_1 obj_06 obj_09)
(pred_1 obj_01 obj_10)
)
)

(:constraints
  (always (not (pred_2 obj_03 obj_09)))
)
)

; plan
1. (op_2 obj_03 obj_06 obj_10 obj_07)
   deleted: (pred_1 obj_06 obj_10) (pred_3 obj_03 obj_07)
   added: (pred_4 obj_03 obj_06 obj_07)
   goals met: 0 of 2
2. (op_1 obj_11 obj_10 obj_09)
   deleted: (pred_2 obj_11 obj_10)
   added: (pred_2 obj_11 obj_09)
   goals met: 0 of 2
3. (op_2 obj_11 obj_01 obj_09 obj_04)
   deleted: (pred_1 obj_01 obj_09) (pred_3 obj_11 obj_04)
   added: (pred_4 obj_11 obj_01 obj_04)
   goals met: 0 of 2
4. (op_1 obj_11 obj_09 obj_10)
   deleted: (pred_2 obj_11 obj_09)
   added: (pred_2 obj_11 obj_10)
   goals met: 0 of 2
5. (op_3 obj_11 obj_01 obj_10 obj_04)
   deleted: (pred_4 obj_11 obj_01 obj_04)
   added: (pred_1 obj_01 obj_10) (pred_3 obj_11 obj_04)
   goals met: 1 of 2
6. (op_3 obj_03 obj_06 obj_10 obj_07)
   deleted: (pred_4 obj_03 obj_06 obj_07)
   added: (pred_1 obj_06 obj_10) (pred_3 obj_03 obj_07)
   goals met: 1 of 2
7. (op_2 obj_11 obj_06 obj_10 obj_04)
   deleted: (pred_1 obj_06 obj_10) (pred_3 obj_11 obj_04)
   added: (pred_4 obj_11 obj_06 obj_04)
   goals met: 1 of 2
8. (op_1 obj_11 obj_10 obj_09)
   deleted: (pred_2 obj_11 obj_10)
   added: (pred_2 obj_11 obj_09)
   goals met: 1 of 2
9. (op_3 obj_11 obj_06 obj_09 obj_04)
   deleted: (pred_4 obj_11 obj_06 obj_04)
   added: (pred_1 obj_06 obj_09) (pred_3 obj_11 obj_04)
   goals met: 2 of 2
